export const pregnancyExamination = [
  {
    key: 'collarHandbook',
    title: '领取母子健康手册',
    data: [
      '微信小程序搜索：上地社区卫生服务中心 ，预约妇幼保健科。',
      '末次月经6周零1天之后才可建档。',
      '双方身份证原件、彩超单、居住证、男方户口本第一页和本人页拍照可以、女方户口本第一页和本人页拍照可以',
    ],
  },
];
/** 孕须知 */
const pregnancyInstructionsInfo = [
  {
    key: 'no',
    title: '不适合孕妇吃的食物',
    data: [
      '糖类️：在代谢的过程中会消耗大量的钙，影响胎儿骨骼发育',
      '味精️：影响人体对锌的吸收，对人体危害大',
      '辛辣️：辣椒、胡椒等容易造成便秘',
      '咖啡因️：具兴奋作用，孕妇大量饮用容易恶心呕吐',
      '桂圆️：孕妇食用后易动胎',
      '木瓜️：孕妇不要吃',
    ],
  },
  {
    key: 'yes',
    title: '适合孕妇吃的食物',
    data: [
      '豆奶制品：每天摄入1000mg钙',
      '全麦食物：麦片粥、全麦面包/饼干',
      '多吃蔬菜：富含维生素',
      '多吃红肉：富含铁，容易被人体吸收',
      '多吃坚果：富含不饱和脂肪酸',
    ],
  },
];

/** 孕周期 */
const pregnancyCycleInfo = [
  {
    key: 1,
    title: '孕1周',
    data: [
      '这一周还没有怀孕，但必定从这周算起',
      '建议：每天补充400微克叶酸，预防胎儿畸形；',
    ],
  },
  {
    key: 2,
    title: '孕2周',
    data: [
      '开始排卵，排卵前1天是最佳受孕时间',
      '建议：不乱吃药物，增加肉类，蛋类的含量.',
    ],
  },
  {
    key: 3,
    title: '孕3周',
    data: [
      '受孕后形成受精卵，此时性别已经确定',
      '建议：注意预防感冒，每天坚持补充叶酸；',
    ],
  },
  {
    key: 4,
    title: '孕4周',
    data: [
      '胚胎着床，胎儿长约0.2cm',
      '不要处于高温环境',
      '1 .抽血尿检，确认怀孕',
      '2 .吃叶酸',
      '3 .远离人群密集的地方',
    ],
  },
  {
    key: 5,
    title: '孕5周',
    data: [
      '胎儿长约0.4cm，正式进入胚胎期',
      '开始出现孕吐反应',
      '1 .保持愉快心情',
      '2 .调整动作，切忌弯腰',
    ],
  },
  {
    key: 6,
    title: '孕6周',
    data: ['胎儿长约0.6cm，妊娠反应明显', '1 .早起一杯水，多吃水果，缓解孕吐'],
  },
  {
    key: 7,
    title: '孕7周',
    data: [
      '胎儿长约0.6cm，妊娠反应明显',
      '早孕反应加大，多休息，保持心情舒畅',
      '1 .避免性生活',
      '2 .不要憋尿，不可泡澡',
      '3 .内裤选择温和、透气的棉质材料',
    ],
  },
  {
    key: 8,
    title: '孕8周',
    data: [
      '胎儿像桂圆一样大小，有头跟躯干了',
      '准妈妈开始出现尿频',
      '1 .B超检查，确认胎儿是否正常',
      '2 .排汗多，勤换内裤',
      '3 .能吃什么就吃什么',
    ],
  },
  {
    key: 9,
    title: '孕9周',
    data: [
      '将近一粒葡萄大小，长约2cm',
      '出现孕期疲劳，犯困，尿频，增加鱼类食物',
      '1 .注意乳房的清洁护理',
      '2 .保持充足睡眠，可午休1小时',
      '3 .每天喝6~8杯水，促进身体新陈代谢',
    ],
  },
  {
    key: 10,
    title: '孕10周',
    data: [
      '胎儿长约4cm，皮肤透明',
      '适当减少鱼肉量，增加蔬菜',
      '1 .避开噪音污染',
      '2 .准备绒毛膜检查染色体先天代谢',
      '3 .避免使用彩妆',
    ],
  },
  {
    key: 11,
    title: '孕11周',
    data: [
      '雌性激素剧增，胸部开始增大',
      '挑选舒适的孕期内衣内裤',
      '1 .按摩增加皮肤弹性',
      '2 .吃DHA、磷脂、碘促 进胎儿脑发育',
      '3 .均衡营养，补充蛋白质',
    ],
  },
  {
    key: 12,
    title: '孕12周',
    data: [
      '胎儿长到8cm，手指跟脚趾可以分开了',
      '开始建档，第一次正式全面产检',
      '1 .NT检查',
      '2 .尽量减少宵夜',
      '3 .每日保持简单适当的 有氧运动',
    ],
  },
  {
    key: 13,
    title: '孕13周',
    data: [
      '宝宝的面部有了五官，头部可以移动',
      '预防静脉曲张，多吃豆制品',
      '1 .开始准备孕期衣服',
      '2 .增加饭量，给宝宝提供更多营养',
    ],
  },
  {
    key: 14,
    title: '孕14周',
    data: [
      '孕吐减轻，开始出现孕期便秘',
      '适当吃粗粮纤维，不吃生冷食物',
      '1 .孕反基本结束，吃点好的',
      '2 .食物一定要煮熟',
      '3 .每天坚持做体操运动',
    ],
  },
  {
    key: 15,
    title: '孕15周',
    data: [
      '许多重要的筛选和诊断测试，如唐氏等',
      '增加鱼、虾类等海产品的摄入',
      '1 .唐氏综合征、胎儿畸形排查（记得提前预约）',
      '2 .多去上社区、医院的课程',
    ],
  },
  {
    key: 16,
    title: '孕16周',
    data: [
      '开始有明显的胎动，胎儿长约16cm',
      '宝宝器官开始快速发育，注意补铁等营养',
      '1 .感受、记录测量胎动',
      '2 .据美国医学研究统计，正常人每天要摄入2000卡，而孕妇需要多摄入300~500卡。',
    ],
  },
  {
    key: 17,
    title: '孕17周',
    data: [
      '宝宝有一根玉米的重量了',
      '多吃小米、高粱米，穿舒适的衣物',
      '1.开始有“胎梦”，购 买一个好的孕妇枕，有效促进你的睡眠。',
      '2.咨询医生做孕期瑜伽',
    ],
  },
  {
    key: 18,
    title: '孕18周',
    data: [
      '宝宝每周增加一个鸡蛋的重量，会翻滚',
      '白天补充水分，晚上减少液体摄入',
      '1 .白天多喝水，补充体内 水分，晚上减少液体摄入',
      '2 .可做羊水穿刺',
    ],
  },
  {
    key: 19,
    title: '孕19周',
    data: [
      '胎儿长约22cm，营养需求增加',
      '每天坚持数胎动，多吃蔬菜补充维生素',
      '1 .可做胎教活动',
      '2 .咨询医生，孕中期可有性行为',
      '3 .保持心情愉悦',
    ],
  },
  {
    key: 20,
    title: '孕20周',
    data: [
      '胎儿长约25cm，孕肚越来越明显',
      '按时产检，注意妊娠高血压',
      '1 .大排崎检查',
      '2 .尽量左卧侧睡觉',
    ],
  },
  {
    key: 21,
    title: '孕21周',
    data: [
      '注意孕期高血压、糖尿病，定期产检',
      '容易出汗，饮食方面注意补贴补钙',
      '1 .准备预约月嫂/月子中心',
      '2 .注意孕期保暖',
      '3 .出现假宫缩，不必担心',
    ],
  },
  {
    key: 22,
    title: '孕22周',
    data: [
      '胎儿大体发育完成，孕妈可能经历便秘',
      '1.需要补充体液和吃纤维丰富的食物，解决好便秘这个问题。',
      '2.学习生产、母乳、育 儿等知识',
    ],
  },
  {
    key: 23,
    title: '孕23周',
    data: [
      '骨骼肌肉已经长成，已有小婴儿模样',
      '控制体重，多吃鱼、豆类坚果类补DHA',
      '1 .注意提前控制血糖',
      '2 .开始买婴儿床，需要时间散味',
    ],
  },
  {
    key: 24,
    title: '孕24周',
    data: [
      '胎儿长约30cm，头发已生长出来',
      '按时做妊娠病筛查，不要长时间久坐',
      '1 .需要做一个血糖检查, 避免患有妊娠糖尿病',
      '2 .宝宝变大，胃可能不舒服',
    ],
  },
  {
    key: 25,
    title: '孕25周',
    data: [
      '宝宝大脑高速发育，孕妈会出现腿抽筋',
      '保持食物种类多样性，多吃健脑食物',
      '1 .睡前做腿部按摩，白天 避免长期站立或坐在一个 位置太久',
      '2 .可以抹橄榄油避免妊 娠纹',
    ],
  },
  {
    key: 26,
    title: '孕26周',
    data: [
      '胎动力气大，有小西瓜一样的重量了',
      '孕妈妈感到腰酸背痛，要注意补钙了',
      '1.宝宝的听力和视力重点发育，这个阶段你会感觉很累，平时要养成午休的习惯',
    ],
  },
  {
    key: 27,
    title: '孕27周',
    data: [
      '体重开始上升，宝宝形成睡眠规律',
      '坚持补铁补钙，多吃谷物杂粮',
      '1 .你的胸部、腹部、腿部开始有妊娠纹，可以适当涂抹一些橄榄油',
      '2 .多吃高纤维食物，包括蔬菜、水果、谷物类',
    ],
  },
  {
    key: 28,
    title: '孕28周',
    data: [
      '进入孕晚期，出现假宫缩，腹部偶尔收紧',
      '注意补充亚麻酸，增加鱼类',
      '1 .假性宫缩这个时期会开始，注意咨询医生',
      '2 .注意控制体重',
      '3 .身体笨重，注意防滑',
    ],
  },
  {
    key: 29,
    title: '孕29周',
    data: [
      '自己无法系鞋带，宝宝对声音有反应',
      '坚持产检，多散步有助于顺产',
      '1 .少吃多餐，避免让自己太饱',
      '2 .预防早产，及时就医问诊',
    ],
  },
  {
    key: 30,
    title: '孕30周',
    data: [
      '胎儿长约37cm，孕妈会觉得喘不过气',
      '要久坐久站，可按摩减轻腿部水肿',
      '1 .继续保持运动，锻炼 身体的耐力，但可以降低运动强度',
      '2 .二次排崎检查',
    ],
  },
  {
    key: 31,
    title: '孕31周',
    data: [
      '子宫的空间越来越小，胎动幅度下降',
      '发现胎动次数明显减少或加快，尽快就医',
      '1 .每天都要数胎动，用这 个方法来判断胎儿的健康状况',
      '2 .开始使用乳头霜',
    ],
  },
  {
    key: 32,
    title: '孕32周',
    data: [
      '胎儿压迫膀胱，排尿次数增加',
      '多吃豆制品菌菇类，少吃鱼腥',
      '1 .观察自己是否有四肢浮肿的现象，警惕先兆子痫',
      '2 .购买待产用品，保持心情愉悦',
    ],
  },
  {
    key: 33,
    title: '孕33周',
    data: [
      '宝宝开始入盆，此时多为头部',
      '坚持数胎动，防止脐带绕颈',
      '1 .宝宝开始向下移动， 接下来的宝宝随时会入盆，关于顺产和剖腹产，到时候听医生的建议。',
    ],
  },
  {
    key: 34,
    title: '孕34周',
    data: [
      '开始准备待产包，控制体重',
      '学习孕妇课堂的分娩知识及宝宝护理',
      '1 .了解拉玛泽呼吸法',
      '2 .会阴按摩减少撕裂&侧切',
    ],
  },
  {
    key: 35,
    title: '孕35周',
    data: [
      '胎儿约44cm，已发育完全',
      '1 .确保自己未被感染B族疑球菌，因为会传染给宝宝，让医生给你做检查',
      '2 .坚持运动，有助于顺产',
    ],
  },
  {
    key: 36,
    title: '孕36周',
    data: [
      '孕肚更大了，胎位下降，尿频更频繁',
      '每天坚持数胎动，准备好婴儿车等大件',
      '1 .胎心监护',
      '2 .盆底肌训练',
      '3 .尿频会更频繁',
    ],
  },
  {
    key: 37,
    title: '孕37周',
    data: [
      '宝宝已足月，随时可能分娩',
      '意是否入盆，容易便秘，可以喝蜂蜜',
      '1 .有些准妈妈已经开始分泌乳汁，需要选择适合哺乳的内衣',
      '2 .了解清楚医院生产流程',
    ],
  },
  {
    key: 38,
    title: '孕38周',
    data: [
      '胎儿长约47.5cm，绒毛开始消失',
      '收拾好待产包，最好开始休产假',
      '1.身体已经进入待产状态，收拾好待产包，感觉 到规律的宫缩时，可以前往医院',
    ],
  },
  {
    key: 39,
    title: '孕39周',
    data: [
      '每2-3天产检一次，分娩方式听医生建议',
      '多吃水果和肉类，保持良好睡眠',
      '1 .常规产检',
      '2 .放松心情，可以读一些关于母乳喂养的书籍',
    ],
  },
  {
    key: 40,
    title: '孕40周',
    data: [
      '出现破水或每5分钟宫缩一次，立即入院',
      '少吃鱼腥和肉类，即将跟宝宝见面',
      '如果还没有分泌迹象，就需要住院待产，虽然可以延迟一周，但提前做好准备还是有必要的。你现在要做的，是好好珍惜宝宝在肚子里的这段美好时光，一个可爱的小宝宝从被发现到呱呱落地。是一个漫长期待的时光。',
    ],
  },
];

export { pregnancyInstructionsInfo, pregnancyCycleInfo };
